---
kind: method
id: M:Autodesk.Revit.DB.ExportDWGSettings.SetDWGExportOptions(Autodesk.Revit.DB.DWGExportOptions)
source: html/f518e57c-4b51-f1ba-114e-51a7d9d3dd92.htm
---
# Autodesk.Revit.DB.ExportDWGSettings.SetDWGExportOptions Method

Sets the options stored in these settings.

## Syntax (C#)
```csharp
public void SetDWGExportOptions(
	DWGExportOptions options
)
```

## Parameters
- **options** (`Autodesk.Revit.DB.DWGExportOptions`) - The options.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null